# RAW DATA TO CLEAN DATA CONVERSION USING PYTHON EDA

In [1]:
import pandas as pd

In [2]:
emp=pd.read_excel(r"E:\NIT Python (ALL Task)\23rd oct.Rawdata.xlsx")

In [3]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [4]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [8]:
emp.shape

(6, 6)

In [9]:
emp.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [10]:
emp.tail()

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [11]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [12]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [13]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [14]:
emp.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [15]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [16]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [25]:
emp['Name'] = emp['Name'].str.replace(r'[^a-zA-Z]','',regex= True) # to remove the \w non word character

In [26]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [19]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [27]:
emp['Domain'] = emp['Domain'].str.replace(r'\W','',regex=True)

In [28]:
emp['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [29]:
emp

    Name       Domain       Age   Location   Salary      Exp
0   Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy      Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics     67-yr        NaN   30000-  5+ year
5    Kim          NLP      55yr      Delhi  6000^$0      10+

In [30]:
emp['Age'] = emp['Age'].str.replace(r'\W','',regex=True)

In [31]:
emp['Age']

0    34years
1       45yr
2        NaN
3        NaN
4       67yr
5       55yr
Name: Age, dtype: object

In [22]:
emp['Age'] = emp['Age'].str.extract('(\d+)')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\kumar\AppData\Local\Temp\ipykernel_21124\1884116463.py:1: SyntaxWarning: invalid escape sequence '\d'
  emp['Age'] = emp['Age'].str.extract('(\d+)')

In [23]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [24]:
emp

     Name          Domain  Age   Location   Salary      Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0       2+
1  Teddy^         Testing   45  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67        NaN   30000-  5+ year
5     Kim             NLP   55      Delhi  6000^$0      10+

In [32]:
emp['Location']=emp['Location'].str.replace(r'\W','',regex=True)

In [33]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [27]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [34]:
emp['Salary'] = emp['Salary'].str.replace(r'\W','',regex=True)

In [35]:
emp['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: object

In [36]:
emp

    Name       Domain      Age   Location Salary      Exp
0   Mike  Datascience  34years     Mumbai   5000       2+
1  Teddy      Testing     45yr  Bangalore  10000       <3
2   Umar  Dataanalyst      NaN        NaN  15000   4> yrs
3   Jane    Analytics      NaN   Hyderbad  20000      NaN
4  Uttam   Statistics     67yr        NaN  30000  5+ year
5    Kim          NLP     55yr      Delhi  60000      10+

In [31]:
emp['Exp']

0         2+
1         <3
2     4> yrs
3        NaN
4    5+ year
5        10+
Name: Exp, dtype: object

In [39]:
emp['Exp'] = emp['Exp'].str.extract('(\d+)')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\kumar\AppData\Local\Temp\ipykernel_21064\3836251810.py:1: SyntaxWarning: invalid escape sequence '\d'
  emp['Exp'] = emp['Exp'].str.extract('(\d+)')

In [40]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [41]:
emp

    Name       Domain      Age   Location Salary  Exp
0   Mike  Datascience  34years     Mumbai   5000    2
1  Teddy      Testing     45yr  Bangalore  10000    3
2   Umar  Dataanalyst      NaN        NaN  15000    4
3   Jane    Analytics      NaN   Hyderbad  20000  NaN
4  Uttam   Statistics     67yr        NaN  30000    5
5    Kim          NLP     55yr      Delhi  60000   10

In [35]:
clean_data = emp.copy()

#### till now we have raw data we use regex to clean the data and removed all noise characted from the dataset 
#### you can also work in same things in sql query as well

- missing values treatment for numerical data

In [36]:
clean_data

     Name          Domain  Age   Location   Salary  Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0    2
1  Teddy^         Testing   45  Bangalore  10%%000    3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000    4
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0  NaN
4  Uttam*      Statistics   67        NaN   30000-    5
5     Kim             NLP   55      Delhi  6000^$0   10